# задайте значение переменной b,
# чтобы результат был 2.5
a = 2
b = 0.5
print(a+b)

# сделайте так, чтобы программа 
# приветствовала вас, используя переменную name 
# и форматирование строк например "Привет, Миша!"

name = 'Valera'
print('Hello, '+name+'!')

#--------------------------------

v = input('Введите число от 1 до 10: ')
print(int(v)-5) 

# поправьте код, чтобы выводилось число
# на 10 больше, чем введённое
# например, пользователь ввел 10 
# программа вывела 20
	
name = input('Введите ваше имя: ')
print('Привет '+name+', как дела?') 

# поправьте код, чтобы выводилась строка
# Привет, ИМЯ! Как дела?


print(float('1'))
print(int('2.5'))           #ошибка, число должно быть целым?
print(bool(1))
print(bool(''))
print(bool(0))